In [10]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [19]:
df = pd.DataFrame(randn(5,4),'A  B C D E'.split(),'W X Y Z'.split())
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [22]:
booldf = df > 0
df[booldf]

          W         X         Y         Z
A       NaN       NaN       NaN  0.485809
B  0.392489  0.221491       NaN  1.541990
C  0.666319       NaN       NaN  1.407338
D  0.641806       NaN       NaN  1.028293
E       NaN       NaN  0.720788       NaN

In [23]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.485809
B  0.392489  0.221491       NaN  1.541990
C  0.666319       NaN       NaN  1.407338
D  0.641806       NaN       NaN  1.028293
E       NaN       NaN  0.720788       NaN

In [24]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [26]:
df[df['W']>0]

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [27]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [37]:
resultdf = df[df['W']>0]
print(resultdf)
resultdf['X']

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

B    0.221491
C   -0.538235
D   -0.905100
Name: X, dtype: float64

In [42]:
#one Step above code 
df[df['W']>0][['X','Y']]

          X         Y
B  0.221491 -0.855196
C -0.538235 -0.568581
D -0.905100 -0.391157

In [49]:
#breaking down the steps . exect the same code as above one 
boolser = df['W']>0
result = df[boolser]
mycols = ['X', 'Y' ]
result[mycols]

          X         Y
B  0.221491 -0.855196
C -0.538235 -0.568581
D -0.905100 -0.391157

In [51]:
df[df['W']>0 and (df['Y']> 1)]
# The truth value of a Series is ambiguous
#python cannot take into account 
#This return series of bollean value but 'and' , 'or' can only deal with one or two boolean value

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

## Multiple conditional selection

In [53]:
#Using | or & , series of boolean value can be deal with
df[(df['W']> 0) | (df['Y'] > 1)]

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [54]:
#resetting index 
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

## Reset index
this method make index into numerical index. (reset)

In [65]:
df.reset_index()

  index         W         X         Y         Z States
0     A -1.467514 -0.494095 -0.162535  0.485809     CA
1     B  0.392489  0.221491 -0.855196  1.541990     NY
2     C  0.666319 -0.538235 -0.568581  1.407338     WY
3     D  0.641806 -0.905100 -0.391157  1.028293     OR
4     E -1.972605 -0.866885  0.720788 -1.223082     CO

In [59]:
newind = 'CA NY WY OR CO'.split()

In [61]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [63]:
df['States'] = newind
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [64]:
#How to set index? 
df.set_index('States')
#overwrite index

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

In [66]:
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO